# NotEnoughRoomForFittingsError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..NotEnoughRoomForFittingsError Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
There was not enough room to place the required fittings. Consider increasing the length of the segments, or moving them farther apart to generate a solution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotEnoughRoomForFittingsError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotEnoughRoomForFittingsError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotEnoughRoomForFittingsError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace